#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for prod</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_api.this will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "API Gateway for ThumbFlow prod environment"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "prod-thumbflow-api"
      + protocol_type                = "HTTP"
      + region                       = "us-east-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_headers     = [
              + "Authorization",
              + "Content-Type",
              + "X-Amz-Date",
              + "X-Api-Key",
            ]
          + allow_methods     = [
              + "GET",
              + "OPTIONS",
              + "POST",
              + "PUT",
            ]
          + allow_origins     = [
              + "*",
            ]
          + expose_headers    = [
              + "Content-Length",
              + "Content-Type",
            ]
          + max_age           = 300
        }
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_integration.lambda_integrations["0"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integrations" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Upload images endpoint"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:099670157298:function:thumbflow-upload-handler-prod"
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = 30000
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_route.routes["0"] will be created
  + resource "aws_apigatewayv2_route" "routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /images"
      + target             = (known after apply)
    }

  # module.thumb_flow.module.api_gateway.aws_apigatewayv2_stage.this will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "prod"
      + region        = "us-east-1"
      + tags          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + path           = "$context.path"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + responseLength = "$context.responseLength"
                  + routeKey       = "$context.routeKey"
                  + status         = "$context.status"
                }
            )
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 10
          + throttling_rate_limit    = 5
        }
    }

  # module.thumb_flow.module.api_gateway.aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/api-gateway/prod-thumbflow-api"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
    }

  # module.thumb_flow.module.api_gateway.aws_lambda_permission.api_gateway_invoke_lambda["0"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "thumbflow-upload-handler-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-0"
      + statement_id_prefix = (known after apply)
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "thumbflow-thumbnail-generator-prod"
      ~ image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/thumbnail-generator:c3f04d868a12fb746a22a433f3c80f0d5768e7dc-16948216463" -> "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/thumbnail-generator:baa4969861929f2dc24bfe73014017907a198bd9-17106285645"
      ~ last_modified                  = "2025-08-13T21:56:47.848+0000" -> (known after apply)
        tags                           = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "ThumbFlow"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.thumb_flow.module.upload_function.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "thumbflow-upload-handler-prod"
      ~ image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/upload-handler:c3f04d868a12fb746a22a433f3c80f0d5768e7dc-16948216463" -> "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/upload-handler:baa4969861929f2dc24bfe73014017907a198bd9-17106285645"
      ~ last_modified                  = "2025-08-13T21:56:47.841+0000" -> (known after apply)
        tags                           = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Project"     = "ThumbFlow"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_url                   = (known after apply)
  + api_routes                        = {
      + "/images" = (known after apply)
    }
  + upload_api_endpoint               = (known after apply)
```

</details>

*Pusher: @blumek, Action: `pull_request`*